app/Controllers/Groups.php

    public function index()
    {
        $groupModel = new \App\Models\GroupsModel();
        $memberModel = new \App\Models\MemberModel();
        $userId = session()->get('id');

        $data = [
            'title' => 'Group Anda'
        ];

        // Ambil semua data member yang usernya adalah user login
        $memberships = $memberModel->where('iduser', $userId)->findAll();

        if (empty($memberships)) {
            // Jika user belum tergabung dalam grup manapun
            $data['groups'] = [];
            return view('groups/index', $data);
        }

        $groupIds = array_column($memberships, 'idgroups');

        // Ambil data grup berdasarkan idgroups yang dimiliki user
        $groups = $groupModel->whereIn('id', $groupIds)->findAll();

        foreach ($groups as &$group) {
            // Hitung jumlah anggota
            $group['total_member'] = $memberModel
                ->where('idgroups', $group['id'])
                ->countAllResults();
---
SELECT *
FROM `member`
WHERE `iduser` = '8'
SELECT *
FROM `groups`
WHERE `id` IN ('8','10')
SELECT COUNT(*) AS `numrows`
FROM `member`
WHERE `idgroups` = '8'