app/Controllers/Home.php

SELECT `tugas`.*, `shared`.`accepted`
FROM `shared`
JOIN `tugas` ON `shared`.`idtugas` = `tugas`.`id`
WHERE `shared`.`sharedto` = '8'
AND `tugas`.`status` NOT IN ('Selesai','Batal')
---
    public function index()
    {
        $sharedModel = new \App\Models\SharedModel();
        $tugasModel = new \App\Models\TugasModel();

        $userId = session()->get('id');

        // Ambil semua tugas yang dibagikan ke user ini dan belum selesai
        $sharedTugas = $sharedModel
            ->join('tugas', 'shared.idtugas = tugas.id')
            ->where('shared.sharedto', $userId)
            ->whereNotIn('tugas.status', ['Selesai', 'Batal'])
            ->select('tugas.*, shared.accepted')
            ->findAll();