app/Controllers/Tugas.php

    public function sharedToMe()
    {
        $sharedModel = new SharedModel();
        $userId = session()->get('id');

        $keyword = $this->request->getGet('keyword');

        // Semua tugas yang dibagikan ke user ini
        $sharedQuery = $sharedModel
            ->select('shared.*, tugas.tugas, tugas.tanggal, tugas.waktu, u.nama as sharedby_name')
            ->join('tugas', 'tugas.id = shared.idtugas')
            ->join('user u', 'u.id = shared.sharedby')
            ->where('shared.sharedto', $userId)
            ->where('shared.sharedtype', 'user');

        if ($keyword) {
            $sharedQuery->like('tugas.tugas', $keyword);
        }

        $sharedTasks = $sharedQuery->orderBy('shared.shareddate', 'DESC')->paginate(10);

        // Tugas yang belum diterima saja
        $pendingTasks = $sharedModel
            ->select('shared.*, tugas.tugas, tugas.tanggal, u.nama as sharedby_name')
            ->join('tugas', 'tugas.id = shared.idtugas')
            ->join('user u', 'u.id = shared.sharedby')
            ->where('shared.sharedto', $userId)
            ->where('shared.sharedtype', 'user')
            ->where('shared.accepted', 0)
            ->orderBy('shared.shareddate', 'DESC')
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `shared`
JOIN `tugas` ON `tugas`.`id` = `shared`.`idtugas`
JOIN `user` `u` ON `u`.`id` = `shared`.`sharedby`
WHERE `shared`.`sharedto` = '8'
AND `shared`.`sharedtype` = 'user'
SELECT `shared`.*, `tugas`.`tugas`, `tugas`.`tanggal`, `tugas`.`waktu`, `u`.`nama` as `sharedby_name`
FROM `shared`
JOIN `tugas` ON `tugas`.`id` = `shared`.`idtugas`
JOIN `user` `u` ON `u`.`id` = `shared`.`sharedby`
WHERE `shared`.`sharedto` = '8'
AND `shared`.`sharedtype` = 'user'
ORDER BY `shared`.`shareddate` DESC
 LIMIT 10
SELECT `shared`.*, `tugas`.`tugas`, `tugas`.`tanggal`, `u`.`nama` as `sharedby_name`
FROM `shared`
JOIN `tugas` ON `tugas`.`id` = `shared`.`idtugas`
JOIN `user` `u` ON `u`.`id` = `shared`.`sharedby`
WHERE `shared`.`sharedto` = '8'
AND `shared`.`sharedtype` = 'user'
AND `shared`.`accepted` = 0
ORDER BY `shared`.`shareddate` DESC