app/Controllers/User.php

SELECT *
FROM `user`
WHERE `user`.`id` = '8'
---
    public function edit($id)
    {
        $data = [
            'title'  => 'Tambah user',
        ];

        $model = new UserModel();
        $data['user'] = $model->find($id);