app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `nama` = 'maldin'
 LIMIT 1
---
    public function getUserByNama($nama)
    {
        return $this->where('nama', $nama)->first();